class Food {
  String name;
  double amount = 100.0;
  double proteins;
  double fats;
  double carbs;
  double calorie;

  Food(this.name, this.proteins, this.fats, this.carbs, this.calorie);


  static List<Food> fetchList() {
    return <Food>[
    Food('Яблоки', 4.5, 0.0, 60.1, 48),
    Food('Батон нарезной', 9.4, 2.7, 50.7, 261),
    Food('Мука пшеничная высшего сорта', 10.4, 0.8, 74.5, 324),
    Food('Хлеб ржаной', 4.7, 0.6, 49.5, 210),
    Food('Омлет', 9.7, 15.5, 1.7, 181),
    Food('Яйцо куриное', 12.7, 11.1, 0.6, 153),
    Food('Яйцо перепелиное', 11.9, 13.3, 0.8, 170),
    Food('Апельсин', 0.8, 0, 8.6, 38),
    Food('Бананы', 1.7, 0, 22.1, 87),
    Food('Виноград', 0.5, 0, 17.8, 73),
    Food('Вишня', 0.9, 0, 11.1, 46),
    Food('Груша', 0.5, 0, 10.6, 41),
    Food('Клубника', 0.6, 0.4, 7, 30),
    Food('Мандарин', 0.9, 0, 8.8, 39),
    Food('Гречневая каша', 4.5, 1.6, 27.4, 137),
    Food('Манная каша', 2.5, 0.3, 16.4, 77),
    Food('Овсяная каша', 3.2, 1.8, 15.4, 93),
    Food('Рисовая каша', 1.5, 0.2, 17.3, 79),
    Food('Колбаса вареная Докторская', 13.4, 22.9, 0, 257),
    Food('Масло подсолнечное', 0, 99.9, 0, 899),
    Food('Масло сливочное 82,5%', 0.5, 82.5, 1, 747),
    Food('Майонез 67%', 3.3, 67, 2.4, 624),
    Food('Масло топленое', 0.4, 98.1, 0.5, 885),
    Food('Йогурт 1.5%', 4.3, 1.5, 8.4, 65),
    Food('Кефир 2,5%', 3, 2.5, 4.0, 51),
    Food('Форель', 19.6, 2.1, 0, 99),
    Food('Конфеты шоколадные', 3.9, 39.7, 54.6, 576),
    Food('Мед', 0.6, 0, 80.5, 312),
    Food('Пряники', 4.4, 2.9, 77.1, 333),
    Food('Сахар', 0.2, 0, 99.6, 377),
    Food('Абрикосы', 0.7, 0, 10.1, 44),
    Food('Молоко 2,5%', 2.8, 2.5, 4.6, 53),
    Food('Сметана 15%', 3, 15, 2.9, 163),
    Food('Творог полужирный', 16.5, 9, 1.9, 156),
    Food('Баранина', 16.2, 15.3, 0, 201),
    Food('Говядина', 18.7, 12.6, 0, 191),
    Food('Конина', 20.3, 7.1, 0, 149),
    Food('Куры', 20.4, 8.6, 0.8, 161),
    ];
  }
}
