class Product{
  String name;
  List<double> price;

  Product(this.name, this.price);

  static List<String> fetchRegions(){
    return <String>['г. Бишкек', 
  'Ысык-Кол обл.', 
  'Нарын обл.',
  'г. Талас',
  'Чуй обл.',
  'Баткен обл.',
  'Жалал-Абад обл.',
  'Ош обл.'
  ];
  }
  

  static List<Product> fetchList(){
    return <Product>[
      Product('Хлеб, 400г', <double>[16.3, 20.5, 17.8, 18.0, 16.8, 18.6, 15.6, 20.8]),
      Product('Макаронные изделия, 1кг', <double>[42.5, 42.8, 50.0, 47.5, 46.5, 43.9, 48.1, 42.5]),
      Product('Масло слив. 1кг', <double>[313.3, 330.0, 302.5, 375.0, 342.5, 326.7, 286.6, 166.7]),
      Product('Молоко 2,5% жирн., 1л', <double>[40.5, 57.5, 75.0, 72.5, 50.8, 71.6, 70.5, 70.0]),
      Product('Сахар, 1кг', <double>[37.3, 36.3, 36.5, 36.5, 35.5, 44.0, 44.2, 48.0]),
      Product('Масло растительное, 1л', <double>[80.8, 83.5, 85.0, 85.0, 86.3, 92.0, 89.0, 95.0]),
      Product('Баранина, 1кг', <double>[338.3, 338.3, 348.8, 345.0, 332.5, 339.3, 328.4, 340.0]),
      Product('Говыдина, 1кг', <double>[346.7, 351.7, 348.8, 345.0, 357.5, 344.7, 326.4, 336.7]),
      Product('Фасоль, 1кг', <double>[91.7, 88.3, 91.3, 65.0, 80.3, 90.8, 98.0, 90.78]),
      Product('Мясо птицы, 1кг', <double>[156.4, 139.2, 135.0, 147.5, 130.0, 149.3, 155.8, 143.3]),
      Product('Яйца, 10шт.', <double>[70.0, 66.7, 80.0, 85.0, 67.5, 68.7, 70.4, 69.3]),
      Product('Картошка, 1кг', <double>[21.7, 19.2, 18.0, 22.5, 16.8, 22.8, 20.4, 22.0]),      
    ];
  }
}